pt_ordering/ordering/src/test/resources/stripe/webhooks/payment_intent_payment_failed.json

{
  "id": "evt_1GcRYrG1fbFG85s9qD4iAz0J",
  "object": "event",
  "account": "acct_1GZxhiG1fbFG85s9",
  "api_version": "2020-03-02",
  "created": 1587973169,
  "data": {
    "object": {
      "id": "pi_1GcRY8G1fbFG85s9S8tMn9ZY",
      "object": "payment_intent",
      "amount": 1127,
      "amount_capturable": 0,
      "amount_received": 0,
      "application": "ca_H8E79xpAO7PKX6rao8QLTYX8V6LMciIG",
      "application_fee_amount": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_1GcRYqG1fbFG85s9FPc3mkf8",
            "object": "charge",
            "amount": 1127,
            "amount_refunded": 0,
            "application": "ca_H8E79xpAO7PKX6rao8QLTYX8V6LMciIG",
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": null,
            "billing_details": {
              "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": "22222",
                "state": null
              },
              "email": null,
              "name": null,
              "phone": null
            },
            "calculated_statement_descriptor": "MALLONE CARLO",
            "captured": false,
            "created": 1587973168,
            "currency": "usd",
            "customer": null,
            "description": null,
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_code": "card_declined",
            "failure_message": "Your card has insufficient funds.",
            "fraud_details": {
            },
            "invoice": null,
            "livemode": false,
            "metadata": {
              "order_id": "22d72550-a31f-44d4-a8fd-8adbd870747d",
              "cart_id": "10935d69-241e-41c2-a68b-d06cb6b5062c"
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "declined_by_network",
              "reason": "insufficient_funds",
              "risk_level": "normal",
              "risk_score": 21,
              "seller_message": "The bank returned the decline code `insufficient_funds`.",
              "type": "issuer_declined"
            },
            "paid": false,
            "payment_intent": "pi_1GcRY8G1fbFG85s9S8tMn9ZY",
            "payment_method": "pm_1GcRYqG1fbFG85s9RmYEpDto",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": "pass",
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 11,
                "exp_year": 2025,
                "fingerprint": "BGeLcW3ExQmCaYcc",
                "funding": "credit",
                "installments": null,
                "last4": "9995",
                "network": "visa",
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": null,
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [
              ],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_1GcRYqG1fbFG85s9FPc3mkf8/refunds"
            },
            "review": null,
            "shipping": null,
            "source": null,
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "failed",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_1GcRY8G1fbFG85s9S8tMn9ZY"
      },
      "client_secret": "pi_1GcRY8G1fbFG85s9S8tMn9ZY_secret_uQC9h1NK2jJmMnUYxZYryUIOy",
      "confirmation_method": "automatic",
      "created": 1587973124,
      "currency": "usd",
      "customer": null,
      "description": null,
      "invoice": null,
      "last_payment_error": {
        "charge": "ch_1GcRYqG1fbFG85s9FPc3mkf8",
        "code": "card_declined",
        "decline_code": "insufficient_funds",
        "doc_url": "https://stripe.com/docs/error-codes/card-declined",
        "message": "Your card has insufficient funds.",
        "payment_method": {
          "id": "pm_1GcRYqG1fbFG85s9RmYEpDto",
          "object": "payment_method",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": "22222",
              "state": null
            },
            "email": null,
            "name": null,
            "phone": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": "pass",
              "cvc_check": "pass"
            },
            "country": "US",
            "exp_month": 11,
            "exp_year": 2025,
            "fingerprint": "BGeLcW3ExQmCaYcc",
            "funding": "credit",
            "generated_from": null,
            "last4": "9995",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1587973168,
          "customer": null,
          "livemode": false,
          "metadata": {
          },
          "type": "card"
        },
        "type": "card_error"
      },
      "livemode": false,
      "metadata": {
        "order_id": "22d72550-a31f-44d4-a8fd-8adbd870747d",
        "cart_id": "10935d69-241e-41c2-a68b-d06cb6b5062c"
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "requires_payment_method",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_6S2yd3hal7sURJ",
    "idempotency_key": null
  },
  "type": "payment_intent.payment_failed"
}
