pt_ordering/ordering/src/test/resources/stripe/webhooks/payment_intent_succeeded.json

{
  "id": "evt_1GYV9JJdRL7ojpuq7z1XWJX8",
  "object": "event",
  "api_version": "2020-03-02",
  "created": 1587033649,
  "data": {
    "object": {
      "id": "pi_1GYV8hJdRL7ojpuqQfX5tABD",
      "object": "payment_intent",
      "amount": 1032,
      "amount_capturable": 0,
      "amount_received": 1032,
      "application": null,
      "application_fee_amount": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_1GYV9JJdRL7ojpuqFsAbekbK",
            "object": "charge",
            "amount": 1032,
            "amount_refunded": 0,
            "application": null,
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_1GYV9JJdRL7ojpuq8bDFp3fJ",
            "billing_details": {
              "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": "42424",
                "state": null
              },
              "email": null,
              "name": null,
              "phone": null
            },
            "calculated_statement_descriptor": "Stripe",
            "captured": true,
            "created": 1587033649,
            "currency": "usd",
            "customer": null,
            "description": null,
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {},
            "invoice": null,
            "livemode": false,
            "metadata": {
              "order_id": "f962fff4-e4b6-452a-b7ab-64fd700ae15d",
              "cart_id": "d3623435-4f05-401c-bb5d-9b922e0c4952"
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 23,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_1GYV8hJdRL7ojpuqQfX5tABD",
            "payment_method": "pm_1GYV9IJdRL7ojpuqlxssEWNj",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": "pass",
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 4,
                "exp_year": 2024,
                "fingerprint": "TSLLp9Uk08QrLHv9",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "network": "visa",
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/acct_1GY4s6JdRL7ojpuq/ch_1GYV9JJdRL7ojpuqFsAbekbK/rcpt_H6iabinEXsTnXdI8GoroGIHMuUhoWNj",
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_1GYV9JJdRL7ojpuqFsAbekbK/refunds"
            },
            "review": null,
            "shipping": null,
            "source": null,
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_1GYV8hJdRL7ojpuqQfX5tABD"
      },
      "client_secret": "pi_1GYV8hJdRL7ojpuqQfX5tABD_secret_vmb7FDb5eoBTUvnGu5qMluoHR",
      "confirmation_method": "automatic",
      "created": 1587033611,
      "currency": "usd",
      "customer": null,
      "description": null,
      "invoice": null,
      "last_payment_error": null,
      "livemode": false,
      "metadata": {
        "order_id": "f962fff4-e4b6-452a-b7ab-64fd700ae15d",
        "cart_id": "d3623435-4f05-401c-bb5d-9b922e0c4952"
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": "pm_1GYV9IJdRL7ojpuqlxssEWNj",
      "payment_method_options": {
        "card": {
          "installments": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_dN86Q23bxWB6pe",
    "idempotency_key": null
  },
  "type": "payment_intent.succeeded"
}
